In [1]:
import pandas as pd
import numpy as np

In [6]:
etiquetas = ['X','YZ','ZB']
mi_lista = [10,20,30]
arr_np = np.array(mi_lista)
d={'X':10,'YZ':20, 'ZB':100}

In [4]:
pd.Series(mi_lista)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=mi_lista,index=etiquetas)

X     10
YZ    20
ZB    30
dtype: int64

In [7]:
pd.Series(arr_np, etiquetas)

X     10
YZ    20
ZB    30
dtype: int32

In [8]:
pd.Series(d)

X      10
YZ     20
ZB    100
dtype: int64

## Indices

In [10]:
import pandas as pd
serie1 = pd.Series([1,2,3,4], index=['USA','China','Francia','Alemania'])
serie1

USA         1
China       2
Francia     3
Alemania    4
dtype: int64

In [12]:
serie2 = pd.Series([1,2,3,4], index=['USA','China','Italia','Japon'])
serie2

USA       1
China     2
Italia    3
Japon     4
dtype: int64

In [34]:
print(serie2[0]) # acceder por indice numerico
print(serie2['USA'])# acceder por indice numerico
print(serie2[-1])

1
1
4

In [23]:
try:
    serie2['Portugal']
except KeyError:
    print('No existe ese indice en la Serie')
except ValueError:
    print('El valor esta erroneo, no es del tipo correcto')

No existe ese indice en la Serie

In [26]:
#forma segura de acceder a los datos
print(serie2.get('Venezuela'))

None

In [33]:
if (serie2.get('Venezuela')==None):
    print('No existe')
else:
    print()

No existe

#### Valores Falso y Verdades - por coersion - conversion implicita

https://www.freecodecamp.org/news/truthy-and-falsy-values-in-python/

In [37]:
#notacion de punto para acceder a los datos
serie2.USA
#notacion con brackets corchetes
serie2['USA']

1

In [40]:
# Metodos de acceso
#loc para acceder por la etiqueta
#iloc para acceder por el # indice
serie2.loc['USA']

1

In [41]:
serie2.iloc[0]

1

In [43]:
# slicing / partir/ sacar vistas de la data, no incluye el indice de la derecha
print(serie2)
serie2.iloc[0:2]

USA       1
China     2
Italia    3
Japon     4
dtype: int64

USA      1
China    2
dtype: int64

In [44]:
serie2.loc['USA':'China'] # en este caso si incluye el indice de la derecha

USA      1
China    2
dtype: int64

In [45]:
print(serie1)
print(serie2)
serie1 + serie2

USA         1
China       2
Francia     3
Alemania    4
dtype: int64
USA       1
China     2
Italia    3
Japon     4
dtype: int64

Alemania    NaN
China       4.0
Francia     NaN
Italia      NaN
Japon       NaN
USA         2.0
dtype: float64

In [ ]:
#NaN -> not a number

### DataFrame

In [46]:
import numpy as np
import pandas as pd

In [47]:
acciones_list =[
    ['AAPL','Apple', 135],
    ['MSFT','Microsoft', 100]
]

In [48]:
acciones_list

[['AAPL', 'Apple', 135], ['MSFT', 'Microsoft', 100]]

In [49]:
pd.DataFrame(acciones_list)

      0          1    2
0  AAPL      Apple  135
1  MSFT  Microsoft  100

In [50]:
pd.DataFrame(acciones_list, index=['Accion1','Accion2'], columns=['Simbolo','Nombre','Precio'])

        Simbolo     Nombre  Precio
Accion1    AAPL      Apple     135
Accion2    MSFT  Microsoft     100

In [51]:
dic = {
    'ticker':['AAPL','MSFT'],
    'nombre':['Apple','Microsoft'],
    'precio':[135,100]
}

pd.DataFrame(dic,index=['Accion1','Accion2'])

        ticker     nombre  precio
Accion1   AAPL      Apple     135
Accion2   MSFT  Microsoft     100

## Acceso a los datos de un dataframe

In [53]:
import pandas as pd
acciones_dic = {
    'ticker': ['AAPL', 'MSFT','GOOGL','NFX','FB'],
    'nombre': ['Apple', 'Microsoft','GOOGLE','Netflix', 'Facebook'],
    'precio': [135, 100.00,1000,50,300]
}

labels = ['A1', 'A2', 'A3', 'A4','A5']
acciones = pd.DataFrame(acciones_dic, index=labels)
acciones

   ticker     nombre  precio
A1   AAPL      Apple   135.0
A2   MSFT  Microsoft   100.0
A3  GOOGL     GOOGLE  1000.0
A4    NFX    Netflix    50.0
A5     FB   Facebook   300.0

In [57]:
## Acceso por nombre de columna, notacion de corchetes
precios = acciones['precio']
precios

A1     135.0
A2     100.0
A3    1000.0
A4      50.0
A5     300.0
Name: precio, dtype: float64

In [56]:
## Notacion de punto
acciones.precio

A1     135.0
A2     100.0
A3    1000.0
A4      50.0
A5     300.0
Name: precio, dtype: float64

In [58]:
acciones.loc['A1']

ticker     AAPL
nombre    Apple
precio      135
Name: A1, dtype: object

In [59]:
acciones.iloc[0]

ticker     AAPL
nombre    Apple
precio      135
Name: A1, dtype: object

In [60]:
## Acceso a un dato especifico
acciones['ticker']['A3'] # [columna][fila]

'GOOGL'

In [61]:
## Acceso usando loc
acciones.loc['A3','precio'] #[fila][columna]

1000.0

In [63]:
acciones.at['A3','precio'] #[fila][columna] es un poco mas explicito el at (para entender)

1000.0

## Slicing - tomar subsets (subconjuntos) de la data - vista

In [66]:
acciones.loc['A1':'A3',['ticker','precio']] # filas, columnas ->de:hasta filas,

   ticker  precio
A1   AAPL   135.0
A2   MSFT   100.0
A3  GOOGL  1000.0

In [68]:
acciones.iloc[1:3,1:2] # recordar que iloc es con indices numericos y excluye el indice de la derecha

       nombre
A2  Microsoft
A3     GOOGLE

In [69]:
acciones.iloc[1:3,1:2]

   ticker     nombre  precio
A1   AAPL      Apple   135.0
A2   MSFT  Microsoft   100.0
A3  GOOGL     GOOGLE  1000.0
A4    NFX    Netflix    50.0
A5     FB   Facebook   300.0

In [70]:
subconjunto = acciones.iloc[1:3,1:2]

In [71]:
subconjunto

       nombre
A2  Microsoft
A3     GOOGLE

## Exploracion de Datos

In [79]:
import pandas as pd
data = pd.read_csv('C:/Users/DELL/Documents/appl.csv', index_col=0) 
#agregar sep=";" para espcificar el serparador
data

                Open        High         Low       Close   Adj Close    Volume
Date
02-01-18  170.160004  172.300003  169.259995  172.259995  168.339050  25555900
03-01-18  172.529999  174.550003  171.960007  172.229996  168.309738  29517900
04-01-18  172.539993  173.470001  172.080002  173.029999  169.091522  22434600
05-01-18  173.440002  175.369995  173.050003  175.000000  171.016678  23660000
08-01-18  174.350006  175.610001  173.929993  174.350006  170.381485  20567800

In [93]:
data = pd.read_excel('C:/Users/DELL/Documents/AAPL.xlsx', index_col=0)
data

                  Open    High         Low       Close   Adj Close    Volume
Date
2018-01-02  170.160004   172.3  169.259995  172.259995  168.339050  25555900
2018-01-03  172.529999  174.55         NaN  172.229996  168.309738  29517900
2018-01-04  172.539993     NaN  172.080002  173.029999  169.091522  22434600
2018-01-05  173.440002   Error  173.050003  175.000000  171.016678  23660000
2018-01-08  174.350006  175.61  173.929993  174.350006  170.381485  20567800

In [85]:
data.iloc[0,1]

170.160004

In [94]:
data.loc['2018-01-02','Open']

170.160004

In [95]:
# Traer la data ya filtrada
columnas =['Date','Open','Adj Close']
data3 = pd.read_excel('C:/Users/DELL/Documents/AAPL.xlsx', index_col=0, usecols=columnas)
data3

                  Open   Adj Close
Date
2018-01-02  170.160004  168.339050
2018-01-03  172.529999  168.309738
2018-01-04  172.539993  169.091522
2018-01-05  173.440002  171.016678
2018-01-08  174.350006  170.381485

In [98]:
#  Cambiar formato del display de la data de pandas
pd.options.display.max_rows = 10
pd.options.display.max_columns = 10
pd.options.display.precision =2 #ajusta la candidad de decimales

In [99]:
data

              Open     High     Low   Close  Adj Close    Volume
Date
2018-01-02  170.16  1.7e+02  169.26  172.26     168.34  25555900
2018-01-03  172.53  1.7e+02     NaN  172.23     168.31  29517900
2018-01-04  172.54      NaN  172.08  173.03     169.09  22434600
2018-01-05  173.44    Error  173.05  175.00     171.02  23660000
2018-01-08  174.35  1.8e+02  173.93  174.35     170.38  20567800

In [100]:
data = pd.read_csv('C:/Users/DELL/Documents/UI.csv', index_col=0)

In [101]:
data

              Open    High     Low   Close  Adj Close  Volume
Date
2020-04-13  154.97  155.00  150.89  153.56     152.55   84800
2020-04-14  157.70  161.50  156.98  160.57     159.51  107200
2020-04-15  158.21  158.21  151.26  152.11     151.11  143400
2020-04-16  153.08  154.87  151.79  153.77     152.75   90300
2020-04-17  155.89  158.01  153.83  157.92     156.88   89100
...            ...     ...     ...     ...        ...     ...
2021-04-05  289.20  294.32  281.07  290.78     290.78  214400
2021-04-06  291.00  291.00  283.14  289.06     289.06  150900
2021-04-07  283.60  290.07  275.26  277.90     277.90  142100
2021-04-08  279.99  289.97  276.08  288.00     288.00  205300
2021-04-09  285.15  288.00  278.28  281.78     281.78   99600

[251 rows x 6 columns]

In [102]:
data.head() # por default solo muestra las primeras 5 filas

              Open    High     Low   Close  Adj Close  Volume
Date
2020-04-13  154.97  155.00  150.89  153.56     152.55   84800
2020-04-14  157.70  161.50  156.98  160.57     159.51  107200
2020-04-15  158.21  158.21  151.26  152.11     151.11  143400
2020-04-16  153.08  154.87  151.79  153.77     152.75   90300
2020-04-17  155.89  158.01  153.83  157.92     156.88   89100

In [103]:
data.head(20)

              Open    High     Low   Close  Adj Close  Volume
Date
2020-04-13  154.97  155.00  150.89  153.56     152.55   84800
2020-04-14  157.70  161.50  156.98  160.57     159.51  107200
2020-04-15  158.21  158.21  151.26  152.11     151.11  143400
2020-04-16  153.08  154.87  151.79  153.77     152.75   90300
2020-04-17  155.89  158.01  153.83  157.92     156.88   89100
...            ...     ...     ...     ...        ...     ...
2020-05-04  155.50  158.31  154.70  157.14     156.10   69700
2020-05-05  159.00  160.22  157.90  158.21     157.17   67400
2020-05-06  159.04  159.67  156.05  157.29     156.25  158200
2020-05-07  160.49  161.71  158.52  160.18     159.12  106300
2020-05-08  176.20  192.87  175.80  188.62     187.37  509000

[20 rows x 6 columns]

In [104]:
data.tail()

              Open    High     Low   Close  Adj Close  Volume
Date
2021-04-05  289.20  294.32  281.07  290.78     290.78  214400
2021-04-06  291.00  291.00  283.14  289.06     289.06  150900
2021-04-07  283.60  290.07  275.26  277.90     277.90  142100
2021-04-08  279.99  289.97  276.08  288.00     288.00  205300
2021-04-09  285.15  288.00  278.28  281.78     281.78   99600

In [108]:
# Verificar los tipos de datos
data = pd.read_csv('C:/Users/DELL/Documents/UI.csv', index_col=0)
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 251 entries, 2020-04-13 to 2021-04-09
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       251 non-null    float64
 1   High       251 non-null    float64
 2   Low        251 non-null    float64
 3   Close      251 non-null    float64
 4   Adj Close  251 non-null    float64
 5   Volume     251 non-null    int64
dtypes: float64(5), int64(1)
memory usage: 13.7+ KB

In [109]:
data3 = pd.read_excel('C:/Users/DELL/Documents/AAPL.xlsx', index_col=0)
data3.head()

              Open     High     Low   Close  Adj Close    Volume
Date
2018-01-02  170.16  1.7e+02  169.26  172.26     168.34  25555900
2018-01-03  172.53  1.7e+02     NaN  172.23     168.31  29517900
2018-01-04  172.54      NaN  172.08  173.03     169.09  22434600
2018-01-05  173.44    Error  173.05  175.00     171.02  23660000
2018-01-08  174.35  1.8e+02  173.93  174.35     170.38  20567800

In [110]:
data3.count()

Open         5
High         4
Low          4
Close        5
Adj Close    5
Volume       5
dtype: int64

In [111]:
data.count()

Open         251
High         251
Low          251
Close        251
Adj Close    251
Volume       251
dtype: int64

In [112]:
# Saber los tipos de datos
data.dtypes

Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [113]:
# Informacion estadistica descriptiva de la data
data.describe()

         Open    High     Low   Close  Adj Close     Volume
count  251.00  251.00  251.00  251.00     251.00     251.00
mean   224.84  229.04  220.65  224.87     224.33  117067.33
std     64.09   65.71   61.80   63.82      64.10   76280.17
min    151.06  154.87  148.28  148.28     147.30   28000.00
25%    177.72  179.82  174.10  176.09     175.23   73900.00
50%    189.00  191.43  186.35  189.12     188.20   98900.00
75%    268.67  274.79  265.89  270.40     269.94  136950.00
max    389.88  401.81  369.00  389.88     389.88  807600.00

In [117]:
data.mean() # la media
data.std() # desviacion estandar
data.max()
data.min()

Open           151.06
High           154.87
Low            148.28
Close          148.28
Adj Close      147.30
Volume       28000.00
dtype: float64

In [118]:
# contar las ocurrencias, de una columna (serie)
data['Open'].value_counts()
data.Open.value_counts()

188.00    2
180.00    2
166.00    2
152.01    2
274.70    1
         ..
153.08    1
178.47    1
177.61    1
178.49    1
156.00    1
Name: Open, Length: 247, dtype: int64

## Enviar a un Excel

In [122]:
import pandas as pd
data = pd.read_csv('C:/Users/DELL/Documents/UI.csv', index_col=0)

data['mov_intraday']=data.Close - data.Open
data.to_excel('UI_mod.xlsx', sheet_name='HojaMod')